@extends('layout.myStructure')

@section('header')
    @parent
    <link rel="stylesheet" href="{{URL::asset('css/bootstrap.rtl.full.css')}}">
    <link rel="stylesheet" href="{{URL::asset('css/profile.css')}}">
    <link rel="stylesheet" href="{{URL::asset('css/result.css')}}">
    <script src="{{URL::asset('js/highcharts.js')}}"></script>
    <script src="{{URL::asset('js/highcharts-more.js')}}"></script>
    <script src="{{URL::asset('js/exporting.js')}}"></script>
    <script>

        $(document).ready(function () {

            x = parseInt($("#totalPage").css('height').split("px")[0]) + 150;
            $(".dark2").css('min-height', x + "px");
        });
    </script>
@stop

@section('main')






    <div class="container-fluid">
        <div class="top_part navbar-fixed-top">
            <p onclick="document.location.href = '{{route('home')}}'">پرسولیو</p>
            {{--<p style="left: 10px;position: absolute;color: white;top: 20px;font-size: 20px;cursor: pointer;"  onclick="document.location.href = '{{route('profile')}}'">بازگشت</p>--}}
            <img onclick="document.location.href = '{{route('profile')}}'" src="images/left.png" height="30px"
                 style="position:absolute;left: 10px;top: 15px;cursor: pointer;">
            {{--<img class="menu_icon" src="images/menuIcon.png" id="menu-toggle" width="50px">--}}
        </div>

        <div class="box">
            <div class="box_top">
                <div class="col-xs-12" style="z-index: 10001 !important;">
                    <div id="barChart1" style="min-width: 310px; height: 400px; margin-top: 10px; direction: ltr"></div>
                    <script type="text/javascript">

                        var tmp = {{json_encode($marks)}};
                        var factors = [];
                        var marks = [];

                        for (i = 0; i < tmp.length; i++) {
                            factors[i] = tmp[i][1];
                            marks[i] = tmp[i][0] * 1;
                        }

                        Highcharts.chart('barChart1', {

                            chart: {
                                polar: true,
                                type: 'line'
                            },

                            title: {
                                text: '',
                                x: 20
                            },

                            pane: {
                                size: '90%'
                            },

                            xAxis: {
                                categories: factors,
                                tickmarkPlacement: 'on',
                                lineWidth: 0
                            },

                            yAxis: {
                                gridLineInterpolation: 'polygon',
                                lineWidth: 0,
                                min: 0,
                                max: 48
                            },
                            tooltip: {
                                useHTML: true,
                                headerFormat: '<table>',
                                pointFormat: '<tr><td style="direction: ltr"><b>{point.y}</b></td></tr>',
                                footerFormat: '</table>',
                                valueDecimals: 0
                            },

                            legend: {
                                align: 'right',
                                verticalAlign: 'top',
                                y: 70,
                                layout: 'vertical'
                            },

                            series: [{
                                name: 'نمرات',
                                data: marks,
                                pointPlacement: 'on'
                            }]

                        });
                    </script>
                    <p class="bg-warning text-danger">
                        اگه نقطه ها در هر شاخص در داخل پنج ضلعی کوچیک قرار بگیره، نمرت در اون شاخص پایینه و اگه خارجش
                        قرار بگیره، بالاس

                    <hr>
                    </p>
                </div>
            </div>

            <p>
                اولین آزمونی که ازت گرفته شد، NEO نام داره که پنج حوزه ی گسترده یا پنج بُعد از شخصیتت رو اندازه‌گیری
                می‌کنه:
                <br>
                ۱. عصبیت و حساسیت
                Neuroticism
                <br>
                ۲. برونگرایی
                Extraversion
                <br>
                ۳. تجربه پذیری
                Openness to experience
                <br>
                ۴. توافق پذیری و نوع دوستی
                Agreeableness
                <br>
                ۵. وظیفه شناسی
                Conscientiousness
                <br>
                <br>
                این آزمون عملا تفاوت های درونیت رو نسبت به بقیه در زمینه ی طرز تفکر، احساس و تعامل نشون می ده که
                می تونه با توصیفاتی که دیگران از شخصیتت دارن مقایسه بشه و بازخورد های مناسبی جهت ارتقا شخصیت و مهارتهای
                ارتباطی به دستت برسونه.
            </p>
            @foreach($marks as $mark)
                <div class="col-md-12 col-xs-12 each_result">
                    @if($mark[1] == "N")
                        <h2>روان رنجور خویی (N):</h2>
                        @if($mark[0] >= 24)
                            <p>وسواس و دقتی که برای کارات به خرج میدی یه مقدار زیاده و بعضی اوقات باعث به وجود اومدن
                                نگرانی و دلهره میشه. همینطور بهتره یه مقدار حساسیتت رو روی مسائل مختلف کمتر کنی تا همیشه
                                از آرامش کافی برای انجام کارات برخوردار باشی. آرامش درونی تو زندگی دانشجویی خیلی موثره و
                                میتونه باعث رسیدن تو به اهدافت بشه.</p>
                        @else
                            <p>معمولا از نظر فکری و احساسی ثبات قابل ملاحظه ای داری، مسائل مختلف زیاد نمیتونن باعث
                                نگرانیت بشن و این خیلی خوبه و همچنین می تونی استرس و فشار های روحی بالا رو کنترل کنی که
                                این واقعا در راستای رسیدن به خواسته های زندگیت کمکت میکنه، افرادی مثل تو معمولا تمرکز
                                خوبی روی مسائل دارن. خیلی تحت تاثیر محیط قرار نمیگیرن البته ممکنه استثنا هایی هم وجود
                                داشته باشه.</p>
                        @endif
                    @elseif($mark[1] == "E")
                        <h2>برون گرایی (E):</h2>
                        @if($mark[0] >= 24)
                            <p>نمره بالا در این شاخص نشونه اینه که آدم برونگرایی هستی! افراد برونگرا معمولا سهم بیشتری
                                از مذاکرات دارن ، علاقه مند به محیط اطرف خودشونن، از مقایسه عقاید خودشون با بقیه لذت
                                میبرن، با آدم های جدید راحت آشنا میشن و به بهترین نحو میتونن باهاشون ارتباط برقرار کنن.
                                شاید بهتر باشه بدونی در محیط های اجتماعی مانند دانشگاه افراد برونگرا معمولا خیلی موفق تر
                                عمل می کنند و باایجاد گروه ها و کانون های علمی و فرهنگی و همچنین پیدا کردن افراد توانمند
                                به سرعت خودشون رو با محیط وفق میدن و شروع به ارزش آفرینی میکنن.</p>
                        @else
                            <p>نمره پایین در این شاخص نشون از درونگرایی تو داره، آدم های درونگرا معمولا کم حرف هستن و
                                علاقه مند به تفکر و مطالعه. معمولا اهل ایده دادن و عقاید نو هستن و برای ارتقا شخصیت
                                خودشون اهمیت بالایی قائلن و سعی میکنن هر روز شخصیت بهتری از خودشون بسازن، ترجیحشون اینه
                                که به جای حضور در اماکن شلوغ و بی نظم در افکار خودشون غرق بشن، افراد موفقی مثل آیزاک
                                نیوتون و ون گوک و خیلی های دیگه شخصیت های این چنینی داشتند. شاید بهتر باشه بدونی اگر از
                                این ویژگی شخصیتیت به خوبی استفاده کنی میتونی به موفقیت های بالایی در زمینه های مورد
                                علاقت برسی.</p>
                        @endif

                    @elseif($mark[1] == "O")
                        <h2>تجربه پذیری (O):</h2>
                        @if($mark[0] >= 24)
                            <p>تو دارای ذهن کنجکاو وعلاقه مند به کسب تجربیات جدید و عقاید مختلف هستی. افراد مثل تو
                                معمولا تحت تاثیر محیط و عرف جامعه قرار نمیگیرند و دقت زیادی در انتخاب افکارشون دارن، به
                                این صورت که ذهنشون روی هر نظر و تفکر جدیدی بازه و با منطق خودشون سعی میکنن مسائل رو
                                موشکافی کنن. در کل میشه گفت افراد با این ویژگی انعطاف پذیری بالایی در وضعیت روانیشون و
                                انتخاب افکارشون دارن.</p>
                        @else
                            <p>فردی پایبند به عقاید شخصی و عرف جامعه هستی و سعیت بر اینه که تفکرات قبلیت رو حفظ کنی و
                                ارتقاشون بدی. معمولا افراد مثل تو زیاد علاقه ای به خطر کردن ندارند و تلاش میکنند با
                                مسائلی که از قبل باهاشون آشنا بودن به فعالیتشون ادامه بدن. نکته مثبت این وضعیت، اینه که
                                تو بهتر میتونی روی مسائل مورد علاقت تمرکز کنی و مسائل جانبی زیاد باعث حواس پرتیت نمیشن.
                                باید تلاش کنی این ویژگیت رو خوب بشناسی و به کار بگیریش!!</p>
                        @endif

                    @elseif($mark[1] == "A")
                        <h2>توافق (A):</h2>
                        @if($mark[0] >= 24)
                            <p>علاقه مند کمک به دیگران و نوع دوست هستی! دوست داری به بهترین نحو به اطرافیانت کمک کنی و
                                از کار تیمی خوشت میاد. افراد مثل تو فعالان اجتماعی و همیاران خیلی خوبی میتونن باشن. باید
                                سعی کنی از این قابلیتی که داری به خوبی برای کمک به دوستان و اطرافیانت استفاده کنی.</p>
                        @else
                            <p>فردی هستی که برای خودت اهمیت زیادی قائلی و ترجیحت بر اینه که بیشتر وقتت رو به ارتقای شخصی
                                تخصیص بدی، افرادی مثل تو در شرایطی مثل مقابله با وضعیت های سخت و بحران ها بهتر میتونن
                                برای خودشون امنیت و راحتی به دست بیارن.</p>
                        @endif

                    @else
                        <h2>وظیفه شناسی (C):</h2>
                        @if($mark[0] >= 24)
                            <p>فردی با وجدان و مسئولیت پذیر هستی، علاقه داری که وظایفت رو به موقع و به بهترین نحو ممکن
                                انجام بدی و بدقولی از تو کمتر سر می زنه. افرادی که این وضعیت رو دارن معمولا مدیریت
                                شخصیشون نسبت به بقیه خیلی بهتره و میتونن بهتر از بقیه به همه ی فعالیت هاشون بپردازن.
                                داشتن چنین ویژگی روانی خوب به شدت برای افرادی که تواما به دنبال موفقیت های علمی و مالی
                                هستن مفیده. چرا که باعث میشه تناسب خوبی میان فعالیت ها و کارهاشون ایجاد کنن.</p>
                        @else
                            <p>علاقه ی زیادی به فعالیت کردن در چارچوب های از قبل مشخص شده نداری و دوست داری هر موقع طبق
                                تصمیمات فردی خودت عمل کنی. افرادی مثل تو این خصوصیت رو دارن که بدون توجه به محدودیت ها و
                                چارچوب ها فعالیت کنن و به دنبال علایقشون برن، معمولا هنرمندان از این نظر بهت شباهت زیادی
                                دارن. باید سعی کنی این ویژگیت رو به خوبی بشناسی تا بتونی خارج از محدودیت های موجود ایده
                                پردازی کنی و برای خودت و محیط اطرافت مفید باشی.</p>
                        @endif

                    @endif
                </div>
            @endforeach
            <div class="col-md-12 col-xs-12" style="margin-top: 40px;">
                <div class="result_detail">
                    <div class="result_detail_top text-warning">
                        <h3>توضیح آزمون نئو</h3>
                    </div>
                    <input type="checkbox" class="read-more-state" id="post-2"/>
                    <div class="read-more-wrap">
                        <ul class="read-more-target " style="text-align: justify;direction: rtl;">
                            <li class="read-more-target col-xs-12">
                                <h3>روان رنجورخویی (N)</h3>
                                <p>
                                    تمایل عمومی به تجربه عواطف منفی چون ترس، غم، دستپاچگی، عصبانیت، احساس گناه و نفرت
                                    مجموعه حیطه N را تشکیل می دهد. شاید عواطف شکننده مانع از سازگاری می شود.
                                    مردان و زنان با نمره بالا در N مستعد داشتن عقاید غیرمنطقی هستند و کمتر قادر به کنترل
                                    تکانشهای خود هستند و خیلی ضعیف تر از دیگران با استرس کنار می آیند.
                                    افرادی که نمرات آنها در N پایین است دارای ثبات عاطفی بوده و معمولاً آرام، معتدل و
                                    راحت هستند و قادرند که با موقعیت های فشارزا بدون آشفتگی یا هیاهو روبه رو شوند.
                                </p>
                            </li>

                            <li class="read-more-target col-xs-12">
                                <h3>برون گرایی (E)</h3>
                                <p>
                                    برونگراها البته جامعه گرا بوده اما توانایی اجتماعی فقط یکی از صفاتی است که حیطه
                                    برونگرایی دارای آن است. علاوه بر آن، دوست داشتن مردم، ترجیح گروه های بزرگ و گردهمایی
                                    ها، با جرات بودن، فعال بودن و پرحرف بودن نیز از صفات برونگراها است. آنها برانگیختگی
                                    جنسی و نیز تحریک را دوست دارند و متمایلند که بشاش باشند. همچنین سرخوش، باانرژی، و
                                    خوش بین نیز هستند. مقیاس های این حیطه به طور قوی با علاقه به ریسک های بزرگ در مشاغل
                                    همبسته است.
                                    هر قدر که نشان دادن مشخصات برون گراها آسان است به همان اندازه نشان دادن ویژگی های
                                    درونگراها مشکل است. در برخی از توصیف ها درونگرایی باید به منزله فقدان برونگرایی در
                                    نظر گرفته شود. تا به عنوان ضد برونگرایی. از این رو افراد درونگرا خوددارترند تا غیر
                                    دوستانه، مستقلند تا پیرو، یکنواخت و متعادل اند تا تنبل و دیرجنب. وقتی منظور این است
                                    این افراد ترجیح می دهند تنها باشند، شاید گفته شود که این افراد کمرو هستند. افراد
                                    درونگرا لزوماً از اضطراب های اجتماعی رنج نمی برند. گرچه این افراد روحیه بسیار شاد
                                    برونگراها را ندارند ولی آدم های غیرخوشحال یا بدبینی نیستند.
                                </p>
                            </li>

                            <li class="read-more-target col-xs-12">
                                <h3>گشودگی در مقابل تجربه (تجربه پذیری) (O)</h3>
                                <p>
                                    عناصر تجربه پذیری چون تصور فعال، احساس زیباپسندی، توجه به احساسات درونی،تنوع طلبی،
                                    کنجکاوی ذهنی و استقلال در قضاوت، اغلب نقشی در تئوری ها و سنجش های شخصیت ایفا نمودند.
                                    اشخاص تجربه پذیر هم درباره دنیای درونی و هم درباره دنیای بیرونی کنجکاو هستند و
                                    زندگانی آنها از لحاظ تجربه غنی است. آنها مایل به پذیرش عقاید جدید و ارزش های
                                    غیرمتعارف بوده و بیشتر و عمیق تر از اشخاص غیرانعطاف پذیر هیجان های مثبت و منفی را
                                    تجربه می کنند.
                                    نمرات تجربه پذیری با آموزش و نمرات هوش همبسته است. تجربه پذیری مخصوصاً با جنبه های
                                    مختلف هوش چون تفکر واگرا که عاملی در خلاقیت می باشد، مربوط است.
                                    مردان و زنانی که نمره پایینی در تجربه پذیری می گیرند، متمایلند که رفتار متعارف داشته
                                    و دیدگاه خود را حفظ نمایند، این افراد وقایع آشناتر را ترجیح می دهند و پاسخ های عاطفی
                                    آنان خیلی محدود است.
                                </p>
                            </li>

                            <li class="read-more-target col-xs-12">
                                <h3>دلپذیر بودن (توافق) (A)</h3>
                                <p>
                                    همانند برونگرایی، دلپذیر بودن مقدمتاً بعدی از تمایلات بعدی از تمایلات بین فردی است.
                                    یک فرد دلپذیر اساساً نوع دوست است، او نسبت به دیگران همدردی کرده و مشتاق است که کمک
                                    کند و باور دارد که دیگران نیز متقابلاً کمک کننده هستند. درمقابل فرد غیر دلپذیر ستیزه
                                    جو، خودمدار و شکاک نسبت به دیگران بوده و رقابت جو است تا همکاری کننده.
                                    نمره پایین در A با حالات خودشیفتگی، ضداجتماعی و اختلال شخصیتی پارانویید همراه بوده
                                    در حالی که نمره بالا در A با اختلال شخصیتی وابسته همراه است.
                                </p>
                            </li>

                            <li class="read-more-target col-xs-12">
                                <h3> باوجدان بودن (وظیفه شناسی) (C)</h3>
                                <p>
                                    فرد با وجدان هدفمند، با اراده و مصمم می باشد. افراد موفق، موسیقی دانان بزرگ و
                                    ورزشکاران به نام این صفات را در حد بالا دارند. نمره بالا در C با موفقیت شغلی و
                                    تحصیلی همراه است. افراد با نمره بالا در C زیاد دقیق، خوش قول و مطمئن هستند.
                                    نمره پایین در C ممکن است موجب شود که فرد از باریک بینی لازم، دقت و پاکیزگی زیاد و
                                    محتاط بودن اجتناب کند. چنین افرادی در به کارگیری اصول اخلاقی زیاد دقیق نیستند.
                                    همچنین آنان در تلاششان برای رسیدن به هدفهایشان بیحال هستند.
                                </p>
                            </li>

                        </ul>
                    </div>
                    <label for="post-2" class="read-more-trigger" style="width: 20px;height: 20px;"></label>
                </div>
            </div>
            <div class="col-md-4 col-md-offset-4 col-xs-12">
                <button style="background-color: #3b0069; color: white; height: 50px;
border: none;border-radius: 50px;width: 100%; margin-bottom: 100px;"
                        onclick="document.location.href = '{{route('likesList')}}'">ادامه
                </button>
            </div>
        </div>
    </div>





    <style>
        .highcharts-background {

        }

        .highcharts-color-0 {
            fill: #ecd6a3;
            stroke: #ab4e1e;
        }

        .highcharts-tooltip-box {
            fill: #6e6e6e;
            stroke-width: 0;
        }

    </style>

@stop